In [1]:
import pandas as pd

In [3]:
#Reading the Dataset

titanic = pd.read_csv("titanic.csv")

In [4]:
#Printing the Data

titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Calculating the Probability of number of females that survived

In [7]:
#Filtering the data as per the requirement

data = titanic[["Survived", "Sex"]]
data.head()

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [8]:
#Counting Number of Females

female_count = data[data.Sex == "female"].Sex.count()
female_count

314

In [9]:
#Counting Number of Survived Persons

survived = data[data.Survived == 1].Survived.count()
survived

342

In [11]:
#Calculating the Probability of Females that Survived

len(data[(data.Sex == "female") & (data.Survived == 1)]) / len(data[data.Sex == "female"])

0.7420382165605095